frontend/controllers/HomeController.php

	public function actionDetail($id){
		if($id){
			$model = Article::findOne($id);
---
SELECT * FROM `article` WHERE `id`='43'