frontend/widgets/links/LinksWidget.php

SELECT * FROM `links` WHERE `status`=1 ORDER BY `sort`
---
    public function run()
    {
    	$model = Links::find()->where(['status'=>1])->orderBy("sort ASC,created DESC")->all();