frontend/models/article/ArticleFront.php

SELECT COUNT(*) FROM `article` WHERE `status`=2
SELECT COUNT(*) FROM `article` WHERE (`status`=2) AND (`tid`=5)
SELECT COUNT(*) FROM `article` WHERE (`status`=2) AND (`cid`=9)
---
	public static function getCount($tid=0,$cid=0,$kw=""){
		if($tid==0 && $cid==0){
			if(empty($kw)){
				$data = static::find()->where(['status'=>2])->count();
			}else{
				$data = static::find()->where(['status'=>2])->andWhere("concat(`title`,`desc`) like :search_kwd")->addParams([':search_kwd'=>'%'.$kw.'%'])->count();
			}
		}elseif($tid!=0 && $cid==0){
			$data = static::find()->where(['status'=>2,'tid'=>$tid])->count();
		}elseif($tid==0 && $cid!=0){
			$data = static::find()->where(['status'=>2,'cid'=>$cid])->count();

SELECT * FROM `article` WHERE `status`=2 ORDER BY `weight` DESC, `created` DESC LIMIT 10 OFFSET 10
SELECT * FROM `article` WHERE (`status`=2) AND (`tid`=5) ORDER BY `weight` DESC, `created` DESC LIMIT 10
SELECT * FROM `article` WHERE (`status`=2) AND (`cid`=10) ORDER BY `weight` DESC, `created` DESC LIMIT 10 OFFSET 10
---
	public static function getArticleInfo($tid=0,$cid=0,$kw="",$count, $page)
	{
		$offset = ($page - 1) * $count;
		if($tid==0 && $cid==0){
			if(empty($kw)){
				$result = static::find()->where(['status'=>2])->orderBy('weight DESC,created DESC')->limit($count)->offset($offset)->all();
			}else{
				$result = static::find()->where(['status'=>2])->andWhere("concat(`title`,`desc`) like :search_kwd")->addParams([':search_kwd'=>'%'.$kw.'%'])->limit($count)->offset($offset)->all();
			}
		}elseif($tid!=0 && $cid==0){
			$result = static::find()->where(['status'=>2,'tid'=>$tid])->orderBy('weight DESC,created DESC')->limit($count)->offset($offset)->all();
		}elseif($tid==0 && $cid!=0){
			$result = static::find()->where(['status'=>2,'cid'=>$cid])->orderBy('weight DESC,created DESC')->limit($count)->offset($offset)->all();

SELECT * FROM `article` WHERE (`status`=2) AND (`is_recommend`=1) ORDER BY `weight` DESC, `created` DESC LIMIT 10
SELECT * FROM `article` WHERE `status`=2 ORDER BY `views` DESC, `created` DESC LIMIT 10
---
	public static function getViewsArticle($recommend=0){
		if($recommend==1){
			return static::find()->where(['status'=>2,'is_recommend'=>1])->orderBy("weight DESC,created DESC")->limit(10)->all();
		}
		return static::find()->where(['status'=>2])->orderBy("views DESC,created DESC")->limit(10)->all();

SELECT * FROM `label` WHERE `id`=8
---
	public static function getLabelName($id){
		$label = Label::findOne($id);

SELECT * FROM `category` WHERE `id`='9'
---
	public static function getCategory($id){
                $cate = Category::findOne($id);