frontend/widgets/detail/DetailWidget.php

UPDATE `article` SET `views`=2 WHERE `id`=43
SELECT * FROM `label` WHERE `id`=9
---
    public function run()
    {
	$id = $_GET['id'];
	$cid =$_GET['cid'];
	$model = ArticleFront::find()->where(['id'=>$id,'cid'=>$cid])->one();
	if(!$model){
		Yii::$app->session->setFlash('error','不存在该文章');
		return false;
	}
	$model->views +=1;
	$model->save(false);
	$label = Label::findOne($model->tid);