frontend/models/tag/TagFront.php

SELECT * FROM `label` WHERE `status`=1
---
	public static function getLabel(){
		return Label::find()->where(['status'=>1])->all();